Repository: zabbix-jp/translation
Catalog: releasenote/releasenote-omegat.tmx
Source language: en_us
Languages: ja

source: [ZBX-2682] added Czech translation; thanks to Jakub Kalas
ja: [ZBX-2682] チェコ語を追加; Jakub Kalasに感謝

source: fixed DM configuration exchange in 32-bit environments
ja: 32ビット環境での分散モニタリングの設定の同期を修正

source: A nice overview of the new functionality is at http://www.zabbix.com/documentation/1.8/manual/about/what_s_new_1.8.8.
ja: 新機能の概要はhttp://www.zabbix.com/documentation/1.8/manual/about/what_s_new_1.8.8から参照することができます。

source: [ZBX-3972] added "Now" and "Done" buttons into js calendar - change action after day selection
ja: [ZBX-3972] jsカレンダーに"Now"と"Done"のボタンを追加し、日を選択したあとのアクションを変更

source: fixed collector for WinXX
ja: WinXXのコレクターを修正

source: [DEV-358] added notification macros {ITEM.NAME[1..9]}
ja: [DEV-358] 通知用マクロ{ITEM.NAME[1..9]}を追加

source: This is the first BETA release in a series of pre-1.8 releases.
ja: このリリースは1.8の開発版の最初のベータリリースです。

source: [ZBX-625] fixed possible incorrect processing of delta for integers if using dbcache
ja: [ZBX-625] dbcacheを利用している場合に誤った整数データの差分計算処理を行う可能性がある問題を修正

source: Please do not upgrade!
ja: アップグレードは実施しないでください。

source: See Upgrade Guide http://www.zabbix.com/manual/v1.1/config_upgrading.php for full details on upgrade procedure.
ja: アップグレードの詳細は、アップグレードガイドを参照してください。http://www.zabbix.com/manual/v1.1/config_upgrading.php

source: [ZBX-2557] fixed incorrect message when add proxy with name that already exist
ja: [ZBX-2557] 既に存在する名前でプロキシを追加すると間違ったメッセージが表示される問題を修正

source: Support of DB2
ja: DB2のサポート

source: It is recommended to upgrade from ZABIX 1.4, 1.4.1 and 1.4.2.
ja: このリリースはZABIX 1.4、1.4.1、1.4.2からアップグレードすることを推奨します。

source: Whole user group can be configured not to have access to ZABBIX front-end.
ja: すべてのユーザグループにZABBIXフロントエンドにアクセスすることができないように設定することができます。

source: improved item and trigger filtering
ja: アイテムとトリガーのフィルタリングを改善

source: [ZBX-956] fixed js error on map link edit
ja: [ZBX-956] マップのリンク編集のjsエラーを修正

source: You may upgrade from ZABBIX 1.1, 1.1.1, 1.1.2 directly to 1.1.3.
ja: ZABBIX 1.1、1.1.1、1.1.2から直接1.1.3にアップグレードする場合、

source: [ZBX-2948] fixed export of trigger dependencies
ja: [ZBX-2948] トリガーの依存関係のエクスポートを修正

source: [ZBX-1668] fixed saving graphs with web items
ja: [ZBX-1668] Webアイテムを含むグラフの保存を修正

source: Zabbix latest releases support running of hundreds of pollers.
ja: 最新版のZabbixは数百のpollerを起動することができます。

source: [ZBX-3541] fixed processing of nodata() function
ja: [ZBX-3541] nodata()関数の処理を修正

source: [ZBX-2671] fixed detection of various system headers during ./configure
ja: [ZBX-2671] ./configure実行時にいくつかのシステムのヘッダファイルを検出するように修正

source: [ZBX-2773] changed buttons css for DO theme
ja: [ZBX-2773] Dark OrangeテーマのためにボタンのCSSを変更

source: added support of Host Template=<template> in actions
ja: アクションにHost Template=の機能を追加

source: [ZBX-2158] fixed map image deletion
ja: [ZBX-2158] マップの画像が削除できなくなる問題を修正

source: [ZBX-2794] fixed sorting in configuration web
ja: [ZBX-2794] Web監視設定のソート処理を修正

source: [ZBX-1324] replaced more user visible strings ZABBIX with Zabbix
ja: [ZBX-1324] ZABBIXと表示されている文字をZabbixに置き換え

source: [ZBX-2016] fixed code with "_itow_s()" and "zbx_wsnprintf" to avoid possible run-time memory corruption.
ja: [ZBX-2016] 「_itow_s()」と「zbx_wsnprintf」においてランタイムメモリ破壊が発生する可能性を修正。

source: [ZBX-2354,ZBX-2635,ZBX-2648] updated Russian translation; thanks to dotneft and zalex_ua
ja: [ZBX-2354,ZBX-2635,ZBX-2648] ロシア語訳を更新; dotneftとzalex_uaに感謝

source: fixed deadlocks in dbcache module
ja: dbcacheモジュールのデッドロックを修正

source: [ZBX-1985,ZBX-2394] fixed icmppingloss[] returning bad values when fping is capable of pinging both address families
ja: [ZBX-1985,ZBX-2394] fpingが両方のアドレスファミリに対してpingを実行することができる時にicmppingloss[]が不正な値を返す問題を修正

source: No patch for Oracle and SQLite is available.
ja: OracleとSQLite用のパッチはありません。

source: Zabbix SIA is proud to announce the availability of Zabbix 1.8.5.
ja: Zabbix SIAはZabbix 1.8.5のリリースをアナウンスすることを光栄に思います。

source: Better graphs
ja: より便利になったグラフ

source: This document contains the release notes for Zabbix 1.8.5rc1.
ja: このドキュメントはZabbix 1.8.5rc1のリリースノートを含みます。

source: [ZBX-2912] added check for valid UTF-8 characters in the incoming data
ja: [ZBX-2912] 受信したデータのUTF-8文字列の正当性チェックを追加

source: Some actions based on event from discovery are implemented, yet most critical ones (link to template) are not implemented yet.
ja: ディスカバリによるイベントにもとづくいくつかのアクションを実装しました。最も重要なアクション(テンプレートへのリンク)はまだ実装されていません。

source: added required server performance info to Status of ZABBIX
ja: ZABBIXサーバのステータス画面に要求されるサーバのパフォーマンス情報を追加

source: [ZBX-1346] document LogSlowQueries configuration parameter
ja: [ZBX-1346] LogSlowQueriesの設定パラメータの説明を修正

source: [ZBX-3183] added screenname GET parameter support to screens.php
ja: [ZBX-3183] screen.phpにスクリーン名を指定するGETパラメータを追加

source: Thanks to Alex Deiter
ja: Alex Deiterに感謝

source: [ZBX-2062] fixed sending of recovery messages multiple times
ja: [ZBX-2062] リカバリメッセージの複数回送信処理を修正

source: [ZBX-4023] fixed excess spacing and fake plural in graph deletion message
ja: [ZBX-4023] グラフの削除メッセージから不要なスペースと翻訳文字列を削除

source: [ZBX-2726] fixed statuses for discovery events
ja: [ZBX-2726] ディスカバリイベントのステータスを修正

source: [ZBX-137] added patch for Oracle
ja: [ZBX-137] オラクル用のパッチを追加

source: Zabbix Proxy can be configured, so that it will initiate all connections to the Server.
ja: すべてのコネクションの開始をサーバから行うようにZabbixプロキシを設定することができます。

source: [ZBX-1624] fixed template linkage popup, when all templates are selected by default
ja: [ZBX-1624] テンプレートリンクのポップアップ画面においてデフォルトですべてのテンプレートが選択状態になっているのを修正

source: fixed timeout handling for SNMP connect
ja: SNMP接続のタイムアウト処理を修正

source: [ZBX-918, ZBX-919] fixed compilation errors for 'unknown' platforms
ja: [ZBX-918, ZBX-919] 不明なプラットフォームのコンパイルエラーを修正

source: [ZBX-2967] added filter for hosts configuration screen
ja: [ZBX-2967] ホスト設定画面にフィルタを追加

source: [ZBX-910] fixed incorrect values for proxy items in the Queue in case of time difference between server and the proxy
ja: [ZBX-910] サーバとプロキシ間の時刻に差があった場合、キューに表示されるプロキシのアイテムの値が正しくない問題を修正

source: [DEV-258] added additional reports based on bar graphs
ja: [DEV-258] バーグラフを元にした付加的なレポートを追加

source: [ZBX-4131] fixed incorrect page shown after login
ja: [ZBX-4131] ログイン後に誤ったページが表示される問題を修正

source: [ZBXNEXT-241] extended proxy screen to show proxy vps and item count
ja: [ZBXNEXT-241] プロキシ画面にプロキシのデータ収集数/秒とアイテム数を表示する機能を追加

source: Zabbix interface has been improved by introducing paging, selection of elements and mass-operations.
ja: 各ページや項目の選択、一括操作など、Zabbixのインターフェースが改善されました。

source: Zabbix SIA is proud to announce the availability of Zabbix 1.8.4.
ja: Zabbix SIAはZabbix 1.8.4のリリースをアナウンスすることを光栄に思います。

source: [ZBX-638] fixed deleting applications on host remove
ja: [ZBX-638] ホスト削除の際のアプリケーション削除の問題を修正

source: Host and group level maintenance periods are supported.
ja: ホストとグループレベルのメンテナンス期間がサポートされます。

source: [ZBX-2809] fixed login problem in case of guest user being disabled
ja: [ZBX-2809] ゲストユーザが無効の場合のログインの問題を修正

source: Added ability to force configuration cache reload of a running server and proxy, which, in the case of active proxy, will also force config re-read from the server.
ja: 動作中のZabbixサーバやZabbixプロキシの設定情報のキャッシュを強制的に再読み込みする機能を追加しました。アクティブプロキシにおいてもZabbixサーバから強制的に設定を再読み込みさせることができます。

source: [ZBX-2161] added permission checks for map link triggers
ja: [ZBX-2161] マップでトリガーとのリンク使用時に権限チェックを追加

source: [ZBX-2986] acknowledges now are hidden in last 20 issue popup when turned off
ja: [ZBX-2986] イベントの障害対応コメントを無効にした場合に最新20件の障害画面に表示しないように修正

source: Please report any issues to Zabbix Bug Tracking system at https://support.zabbix.com.
ja: 問題があった場合はZABBIXバグトラッキングシステムhttps://support.zabbix.comに報告をお願いします。

source: [ZBX-4345] fixed counting of recursive dependency levels for triggers
ja: [ZBX-4345] トリガーの再帰的な依存関係のカウントを修正

source: ZABBIX database cache module, when enabled by the parameter StartDBSyncers, increases speed of ZABBIX up-to 4-8x times depending on the configuration.
ja: StartDBSyncersパラメータで有効化できるZABBIXデータベースキャッシュは、4〜8重以上の依存関係を持った設定で動作速度を改善します。

source: Zabbix SIA is proud to announce the availability of Zabbix 1.8.9rc2 (Second Release Candidate).
ja: Zabbix SIAはZABBIX 1.8.9rc2 (2番目のRelease Candidate)のリリースをアナウンスすることを光栄に思います。

source: [ZBX-3281] fixed system.cpu.util[] for all processors combined on NetBSD
ja: [ZBX-3281] NetBSDのsystem.cpu.util[]をすべてのプロセッサを合わせたものに修正

source: [ZBX-3270] fixed server crash when processing calculated items with non-numeric user macros
ja: [ZBX-3270] 数値ではないユーザマクロを利用した計算アイテムの処理中にサーバがクラッシュする問題を修正

source: [ZBX-351] added support of floating point values w/o zero (.12)
ja: [ZBX-351] ゼロを含まない浮動小数値のサポートを追加

source: [ZBX-443] removed excess space after detail messages
ja: [ZBX-443] 詳細なメッセージの後の過度な空白の削除

source: [ZBX-2910] fixed 'strerror_from_system undefined' compilation warning on Windows; thanks to Takanori Suzuki
ja: [ZBX-2910] Windows上でコンパイル時に'strerror_from_system undefined'の警告が出る問題を修正; Takanori Suzukiに感謝

source: [ZBX-3120] fixed error when create new map
ja: [ZBX-3120] 新規マップ作成時のエラーを修正

source: List of Bugs and Improvements included into 1.8.5rc1
ja: 1.8.5rc1に含まれるバグフィックスと改善の一覧

source: This document contains the release notes for ZABBIX 1.6.3.
ja: このドキュメントはZABBIX 1.6.3のリリースノートを含みます。

source: [ZBX-271] added support of system.boottime[] for OpenBSD & FreeBSD agents
ja: [ZBX-271] OpenBSDとFreeBSD用エージェントにアイテムsystem.boottime[]を追加

source: See documentation for DB2 specific installation instructions.
ja: DB2特有のインストール方法についてはドキュメントを参照してください。

source: [ZBX-1513] fixed resetting user password when updating user and HTTP auth is enabled
ja: [ZBX-1513] ユーザ情報を更新してHTTP認証を有効にするとユーザのパスワードがリセットされる問題を修正

source: fixed bad performance of the string functions - added two database indexes
ja: 2つのデータベースインデックスを追加し、string関数のパフォーマンスの悪さを改善

source: [ZBX-32] fixed incorrect processing of IP ranges in ip_in_list
ja: [ZBX-32] ip_in_listのIPの範囲の誤った処理を修正

source: Special processing of well known SNMP OIDs
ja: 既知(well known)のSNMP OIDの特別な処理

source: [ZBX-2781] fixed timeline in case of usertime goes over possible period
ja: [ZBX-2781] 表示可能な時間を超えたグラフの期間選択の問題を修正

source: Performance and availability of DNS resources can be effectively monitored.
ja: DNSリソースのパフォーマンスと可用性を効果的に監視することができます。

source: Zabbix SIA is proud to announce the availability of Zabbix 1.8.3.
ja: Zabbix SIAはZABBIX 1.8.3のリリースをアナウンスすることを光栄に思います。

source: A new way of sending SMS messages was added to Zabbix.
ja: SMSメッセージを送信する新しい方法をZabbixに追加しました。

source: [ZBX-4072] improved performance of event acknowledging
ja: [ZBX-4072] イベントの障害対応コメントの処理パフォーマンスを改善

source: Low level discovery
ja: ローレベルディスカバリ

source: More accurate ICMP pings
ja: より正確なICMP Ping

source: At the moment it is not fully usable as there is no way to react on events generated by the auto-discovery module.
ja: 現時点ではオートディスカバリによって生成されるイベントによって特定の動作を行わせることができないため、完全には利用できません。

source: [ZBX-562] fixed improper host group delete action
ja: [ZBX-562] ホストグループの削除処理の誤りを修正

source: [ZBX-168] pass DNS or IP address instead of host name to external scripts
ja: [ZBX-168] 外部スクリプトにホスト名ではなくDNS名またはIPアドレスを渡すように修正

source: We would like to thank other companies and individuals for their active participation in development of Zabbix.
ja: 我々はその他のZabbixの開発に参加してくれている会社や個人の方々に感謝します。

source: [ZBX-1001] fixed possible server crash while processing macros {ITEM.LASTVALUE}
ja: [ZBX-1001] {ITEM.LASTVALUE}マクロの処理中にサーバがクラッシュする可能性がある問題を修正

source: [ZBX-481] fixed permission issue in slideshow
ja: [ZBX-481] スライドショーの権限の問題を修正

source: Fixes and minor improvements
ja: 修正とマイナーな改善

source: This document contains the release notes for ZABBIX 1.6.2.
ja: このドキュメントはZABBIX 1.6.2のリリースノートを含みます。

source: [ZBX-1381] performance improvements for maps view
ja: [ZBX-1381] マップ表示のパフォーマンスを改善

source: [ZBX-2311] fixed Host group empty value selection for items filtering
ja: [ZBX-2311] アイテムのフィルターでホストグループの空白ボタンを押した時の問題を修正

source: added standart sorting to screens
ja: 画面に標準の並べ替え機能を追加

source: [ZBX-979] host mass update templates now only link new templates
ja: [ZBX-979] ホストの一括更新を新規テンプレートのリンクだけ行うように修正

source: [ZBX-1068] fix typos related to height/high
ja: [ZBX-1068] hight/highに関する記述間違いを修正

source: fixed audit log record for graph update action "added" -> "updated"
ja: グラフ更新時の監査ログ記録を「追加」から「更新」に修正

source: [ZBX-954] fixed various minor typos and formatting errors
ja: [ZBX-954] 軽微な表記間違いおよび書式エラーを修正

source: [ZBX-932] fixed typo in changelog
ja: [ZBX-932] 変更履歴の表記間違いを修正

source: [ZBX-420] added support of log files in screens
ja: [ZBX-420] スクリーンにログファイル表示のサポートを追加

source: [ZBX-1840] fixed bad performance of the node synchronization - fixed database index
ja: [ZBX-1840] データベースのインデックスの修正により、ノード間の同期のパフォーマンスを改善

source: Zabbix SIA is proud to announce the availability of Zabbix 1.8.2.
ja: ZABBIX SIAはZABBIX 1.8.2のリリースをアナウンスすることを光栄に思います。

source: [ZBX-3441] fixed server to not process items that are disabled or removed
ja: [ZBX-3441] 無効化または削除されたアイテムを処理しないようにサーバを修正

source: Support of per-CPU system.cpu.util and support of system.cpu.num under Linux and Solaris.
ja: LinuxとSolaris用エージェントにsystem.cpu.numとCPUごとのsystem.cpu.utilを追加しました。

source: [ZBX-2242] fixed agent crash on HP-UX when processing logrt[] items
ja: [ZBX-2242] logrt[]アイテムを処理する際のHP-UXエージェントのクラッシュを修正

source: [ZBX-586] added simple check tcp_perf into help_items
ja: [ZBX-586] help_itemsにシンプルチェックtcp_perfを追加

source: [ZBX-3551] fixed image XML export for Postgres
ja: [ZBX-3551] PostgreSQL利用時のイメージのエクスポートを修正

source: Zabbix JMX monitoring allows native secure remote monitoring of Java applications and popular middlewares such as JBoss, WebSphere and WebLogic.
ja: ZabbixのJMX監視は、JavaアプリケーションやJBoss、WebSphere、WebLogicなどの一般的なミドルウェアのネイティブで安全なリモート監視を行うことができます。

source: [ZBX-3352] made item Y axis min/max items also change when used in screen with Dynamic enabled
ja: [ZBX-3352] スクリーンのダイナミックアイテムを有効化した場合にアイテムのY軸の最小/最大も変化するように修正

source: This document contains the release notes for ZABBIX 1.6.1.
ja: このドキュメントはZABBIX 1.6.1のリリースノートを含みます。

source: Support of directories in the parameter Include
ja: Includeパラメータがディレクトリをサポート

source: [ZBX-933] fixed user profile auto-logout behavior
ja: [ZBX-933] ユーザプロファイルの自動ログアウトの挙動を修正

source: Item zabbix[process,type,mode,state] allows to monitor busy or idle percentage of different Zabbix server processes over the last minute.
ja: zabbix[process,type,mode,state]アイテムを使用してZabbixサーバプロセスの直近のビジー状態またはアイドル状態の割合を監視することができます。

source: [ZBX-365] added support of long process names for proc.num and proc.mem, Linux 2.6
ja: [ZBX-365] Linux2.6のproc.numとproc.memに長いプロセス名のサポートを追加

source: What's New in 1.9.3
ja: 1.9.3の変更点

source: What's New in 1.9.2
ja: 1.9.2の変更点

source: What's New in 1.9.1
ja: 1.9.1の変更点

source: Added support of macro {EVENT.ID} and {TRIGGER.ID}
ja: {EVENT.ID}と{TRIGGER.ID}マクロを追加

source: What's New in 1.9.0
ja: 1.9.0の変更点

source: [DEV-263] added support of a new map element - simple image
ja: [DEV-263] マップの要素にシンプルイメージを表示する機能を追加

source: [ZBX-506] fixed duplicate UnavailableDelay in zabbix_server.conf
ja: [ZBX-506] zabbix_server.confの重複するUnavailableDelayの修正

source: [ZBX-1757] fixed oracle 1.8 upgrade patch, not null constraints
ja: [ZBX-1757] Oracleの1.8へのアップグレードパッチのnot null制約の問題を修正

source: [ZBX-1357] removed outdated translation strings from all translations
ja: [ZBX-1357] すべての翻訳から不要な翻訳文字列を削除

source: Japanese translation
ja: 日本語の翻訳ファイル

source: Added standart sorting to screens
ja: 画面に標準の並べ替え機能を追加

source: ZABBIX SIA is proud to announce the availability of ZABBIX 1.4.5.
ja: ZABBIX SIAはZABBIX 1.4.5のリリースをアナウンスすることを光栄に思います。

source: fixed handling of -c parameter in zabbix_sender.
ja: zabbix_senderの-cパラメータの処理を修正

source: [ZBX-4424] fixed handling of a long localized content by history syncer
ja: [ZBX-4424] history syncerによるローカライズされた長いコンテンツの処理を修正

source: [ZBX-2962] fixed template macro update
ja: [ZBX-2962] テンプレートのマクロの更新を修正

source: See Zabbix Manual for a detailed upgrade procedure.
ja: 詳細なアップグレード手順はZABBIXマニュアルを参照してください。

source: [ZBXNEXT-458] user macros (e.g., {$MACRO}) can now be used in item and trigger descriptions
ja: [ZBXNEXT-458] ユーザマクロ(例: {$MACRO})をアイテムやトリガーの説明に利用できるように修正

source: [DEV-316] implemented displaying of history of remote commands
ja: [DEV-316] リモートコマンドの履歴の表示を実装

source: Last access time is displayed for users
ja: ユーザの設定画面に最終アクセス時間を表示

source: [ZBX-1473] fixed installation requires mb_string function from php 5.2
ja: [ZBX-1473] php 5.2からインストーラがmb_string関数を要求する問題を修正

source: [ZBX-1908] fixed file and socket descriptors leaking to child processes; thanks to Dan Horak
ja: [ZBX-1908] ファイルやソケットのディスクリプタが子プロセスにリークする問題を修正; Dan Horakに感謝

source: [ZBX-2367] improved using DISTINCT rule in queries in API
ja: [ZBX-2367] APIのクエリにDISTINCTルールを利用できるように改善

source: Now this is a central part of ZABBIX front-end.
ja: 現在、この機能はZABBIXフロントエンドの中心となる機能です。

source: support of macro {ITEM.LASTVALUE} for notifications and trigger names
ja: 通知トリガー名に利用できるマクロ{ITEM.LASTVALUE}を追加

source: [ZBX-4070] improved performance of handling of trigger functions
ja: [ZBX-4070] トリガー関数の処理のパフォーマンスを改善

source: [ZBX-1561] fixed errors when view event info as admin user
ja: [ZBX-1561] adminユーザでイベント情報閲覧した際のエラーを修正

source: Advanced DNS monitoring
ja: DNS監視の改善

source: [ZBX-1823] improved map element labels expansion in map editing screen
ja: [ZBX-1823] マップ編集画面のマップ要素のラベルの拡張機能を改善

source: Zabbix uses high-performance OCI library for Oracle connectivity.
ja: ZabbixはOracleとの接続にハイパフォーマンスなOCIライブラリを利用します。

source: [ZBXNEXT-424] enhanced status of trigger filter
ja: [ZBXNEXT-424] トリガーの状態のフィルタ機能を強化

source: Active only mode for ZABBIX agent
ja: ZABBIXエージェントのアクティブのみのモードを追加

source: ZABBIX SIA is proud to announce the availability of ZABBIX 1.4.4.
ja: ZABBIX SIAはZABBIX 1.4.4のリリースをアナウンスすることを光栄に思います。

source: [ZBX-2266] fixed server crash when processing malformed calculated items
ja: [ZBX-2266] 不正な計算アイテムの処理によりサーバがクラッシュする問題を修正

source: [ZBX-845] fixed calculation of delayed items for non-local nodes in Queue screen
ja: [ZBX-845] キュー画面のローカルではないノードのアイテムの遅延の計算を修正

source: [ZBX-1110] improved History of events statement
ja: [ZBX-1110] イベントの状態の履歴を改善

source: [ZBX-92] fixed overwriting of new information for distributed monitoring
ja: [ZBX-92] 分散モニタリングの新しい情報の上書き機能を修正

source: fixed wrong result of function "nodata" after server restart
ja: サーバ再起動後の「nodata」関数の間違った動作を修正

source: [ZBX-1346] use single quotes in example frontend configuration file
ja: [ZBX-1346] Webインターフェースのサンプル設定ファイルにシングルクォートを使用

source: These patches are under upgrades/dbpatches/1.3/, for MySQL and PostgreSQL only.
ja: このパッチはupgrades/dbpatches/1.3/下にあります。MySQL用とPostgreSQL用のみ提供しています。

source: Zabbix SIA is proud to announce the availability of Zabbix 1.8.9.
ja: ZABBIX SIAはZABBIX 1.8.9のリリースをアナウンスすることを光栄に思います。

source: Zabbix supports nanosecond resolution for historical data.
ja: ヒストリデータにナノ秒単位で時間を保存することができます。

source: added time filter in "Availability report"
ja: 稼働レポートに時間によるフィルタ機能を追加

source: [ZBX-3223] it is now possible to gather network interface statistics under a normal user on OpenBSD; thanks to Robert Nagy
ja: [ZBX-3223] OpenBSD上で一般ユーザでもネットワークの統計情報を収集することができるように修正; Robert Nagyに感謝

source: [ZBX-1126] fixed large numbers processing for values stored as 'Delta'
ja: [ZBX-1126] 値を「差分」で保存する際に大きい値の処理を修正

source: added support of character ':' for item keys
ja: アイテムのキーに文字列「:」を利用できるように修正

source: [ZBX-1688] hosts, user doesn't have permission to, are shown gray in hostgroup configuration screen
ja: [ZBX-1688] ホストグループ設定画面で権限がないホストはグレーアウトするように修正

source: [ZBX-3490] added support for LVM devices and full path to devices to vfs.dev.read and vfs.dev.write; thanks to Takanori Suzuki
ja: [ZBX-3490] vfs.dev.readとvfs.dev.writeにLVMデバイスとデバイスのフルパスのサポートを追加; Takanori Suzukiに感謝

source: [ZBX-613] fixed possible incorrect evaluating of trigger functions if using dbcache
ja: [ZBX-613] dbcacheを利用している場合に誤ったトリガー関数の評価を行う可能性がある問題を修正

source: Zabbix Agents
ja: Zabbixエージェント

source: [DEV-450] added support of LogSlowQueries option
ja: [DEV-450] LogSlowQueriesオプションを追加

source: [ZBX-2785] creation of empty slideshows prohibited
ja: [ZBX-2785] 空のスライドショーの作成を禁止

source: Any screen can be printed in a nice way by pressing the Print link.
ja: すべての画面は印刷のリンクをクリックすることにより簡単に印刷することができます。

source: [ZBX-1380] improved performance viewing inventory host
ja: [ZBX-1380] インベントリのホスト表示のパフォーマンスを改善

source: [ZBX-535] added support of monitoring files larger than 2GB in windows
ja: [ZBX-535] Windows上の2G以上のファイルの監視をサポート

source: The screen will display information about triggers and associated events.
ja: トリガーと関連するイベントの情報を画面に表示することができます。

source: [ZBX-2825] made profile form redirect to the last visited page on successful save
ja: [ZBX-2825] プロファイル画面で保存成功時に最後にアクセスした画面に戻れるように修正

source: [ZBX-2075] admins now have access only to users they share usergroup with [action operations]
ja: [ZBX-2075] Zabbix管理者は「アクションのオペレーション」でユーザグループを共有しているユーザへのみアクセスできるよう修正

source: It allows to use ZABBIX in embedded environments.
ja: それにより、組み込み環境でもZABBIXを利用することができます。

source: ZABBIX SIA is proud to announce the availability of ZABBIX 1.4.7.
ja: ZABBIX SIAはZABBIX 1.4.7のリリースをアナウンスすることを光栄に思います。

source: [ZBX-2041] minor configuration comment change about LogFile parameter for Windows agent
ja: [ZBX-2041] WindowsエージェントのLogFileパラメータの設定コメントを変更

source: [ZBX-2144] fixed internal and aggregate checks for hosts monitored by a proxy
ja: [ZBX-2144] プロクシを使用して監視した際の、ホストに対するインターナルチェックとアグリゲートチェックを修正

source: Boolean data type
ja: Booleanデータ型

source: fixed SQL statement in SLA processing
ja: SLAの計算処理のSQLステートメントを修正

source: Support of sound and visual messages
ja: サウンドと視覚的なメッセージのサポート

source: See ZABBIX Manual for a detailed upgrade procedure.
ja: 詳細なアップグレード手順はZABBIXマニュアルを参照してください。

source: [ZBX-1639] fixed processing of logrt[] check
ja: [ZBX-1639] logrt[]チェックの処理を修正

source: [ZBX-2433] fixed time not updated on slides when now is selected
ja: [ZBX-2433] 現在を選択している場合にスライド上で時間が更新されない問題を修正

source: What's New in 1.7 (alpha)
ja: ZABBIX 1.7 (alpha)の変更点

source: [ZBX-3220] fixed error when delete host on postgresql db
ja: [ZBX-3220] PostgreSQLデータベース利用時のホスト削除時のエラーを修正

source: Zabbix SIA is proud to announce the availability of Zabbix 1.8.6.
ja: Zabbix SIAはZabbix 1.8.6のリリースをアナウンスすることを光栄に思います。

source: [DEV-275] changed value processing.
ja: [DEV-275] 値の処理方法を変更

source: added more flexibility to scripts
ja: より柔軟性のあるスクリプト

source: Added Ldap authentication
ja: LDAP認証を追加

source: added dotted drawing type for links of map
ja: マップのリンクの線種に点線を追加

source: [ZBX-1005] fixed evaluations of functions diff, change and abschange for character items if received value more than 255 characters
ja: [ZBX-1005] 255文字以上の値を受信した場合に、文字列のアイテムのdiff、change、abschangeの評価を修正

source: [DEV-333] added configuration data cache module
ja: [DEV-333] 設定データのキャッシュモジュールを追加

source: [ZBX-1904] fixed naming procedure for discovered IPv6 hosts without DNS provided by replacing all not-allowed symbols with '_'
ja: [ZBX-1904] DNSがない環境でディスカバリで発見されたIPv6ホストのホスト名の命名規則を、許可されていないすべての記号を「_」に置き換えるように修正

source: [ZBX-2240] fixed "undefined index" in monitoring latest data
ja: [ZBX-2240] 監視データ->最新データ画面の「未定義のインデックス」問題を修正

source: [ZBX-3259] fixed log trigger wizard functionality: now it can be used for any item with value type = log, text or char
ja: [ZBX-3259] ログ、テキスト、文字列のデータ型を持つアイテムも利用できるようにログトリガーウィザード機能を修正

source: Added support of auto-login
ja: 自動ログインのサポートを追加

source: ZABBIX SIA is proud to announce the availability of ZABBIX 1.4.6.
ja: ZABBIX SIAはZABBIX 1.4.6のリリースをアナウンスすることを光栄に思います。

source: updated Japanese locale thanks to Kodai
ja: [ZBX-1800] 日本語訳の更新; Kodaiに感謝

source: [ZBX-1292] item names are now prefixed with host names, if they are from different hosts in trigger discription popup
ja: [ZBX-1292] トリガーの説明のポップアップが別のホストから呼び出されたときに、アイテム名の前にホスト名を表示するように修正

source: ZABBIX Sender has been improved to support sending of multiple values by one TCP connection.
ja: ZABBIX Senderは1つのTCPコネクションで複数のデータを送信するように改善されました。

source: [ZBX-2053] fixed evaluating of case sensitivity on the server/agent side of regular expressions
ja: [ZBX-2053] サーバとエージェントの大文字小文字を区別する正規表現の評価を修正
